Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/drmtcm.h
/*
 * Component description for DRMTCM
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-06-28T20:38:26Z */
#ifndef _PIC32CZCA90_DRMTCM_COMPONENT_H_
#define _PIC32CZCA90_DRMTCM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DRMTCM                                       */
/* ************************************************************************** */

/* -------- DRMTCM_CTRLA : (DRMTCM Offset: 0x00) (R/W 32) CONTROL ENABLE REGISTER A -------- */
#define DRMTCM_CTRLA_RESETVALUE               _UINT32_(0x02)                                       /*  (DRMTCM_CTRLA) CONTROL ENABLE REGISTER A  Reset Value */

#define DRMTCM_CTRLA_SWRST_Pos                _UINT32_(0)                                          /* (DRMTCM_CTRLA) DRMTCM Software Reset Position */
#define DRMTCM_CTRLA_SWRST_Msk                (_UINT32_(0x1) << DRMTCM_CTRLA_SWRST_Pos)            /* (DRMTCM_CTRLA) DRMTCM Software Reset Mask */
#define DRMTCM_CTRLA_SWRST(value)             (DRMTCM_CTRLA_SWRST_Msk & (_UINT32_(value) << DRMTCM_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the DRMTCM_CTRLA register */
#define DRMTCM_CTRLA_ENABLE_Pos               _UINT32_(1)                                          /* (DRMTCM_CTRLA) DRMTCM ECC Enable (ON) bit (default ECC is always enabled) Position */
#define DRMTCM_CTRLA_ENABLE_Msk               (_UINT32_(0x1) << DRMTCM_CTRLA_ENABLE_Pos)           /* (DRMTCM_CTRLA) DRMTCM ECC Enable (ON) bit (default ECC is always enabled) Mask */
#define DRMTCM_CTRLA_ENABLE(value)            (DRMTCM_CTRLA_ENABLE_Msk & (_UINT32_(value) << DRMTCM_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the DRMTCM_CTRLA register */
#define DRMTCM_CTRLA_Msk                      _UINT32_(0x00000003)                                 /* (DRMTCM_CTRLA) Register Mask  */


/* -------- DRMTCM_CTRLB : (DRMTCM Offset: 0x04) (R/W 32) CONTROL ENABLE REGISTER B -------- */
#define DRMTCM_CTRLB_RESETVALUE               _UINT32_(0x70707)                                    /*  (DRMTCM_CTRLB) CONTROL ENABLE REGISTER B  Reset Value */

#define DRMTCM_CTRLB_IERRCNT_Pos              _UINT32_(0)                                          /* (DRMTCM_CTRLB) ITCM ERROR MAXIMUM COUNT (default 0x7) Position */
#define DRMTCM_CTRLB_IERRCNT_Msk              (_UINT32_(0xFF) << DRMTCM_CTRLB_IERRCNT_Pos)         /* (DRMTCM_CTRLB) ITCM ERROR MAXIMUM COUNT (default 0x7) Mask */
#define DRMTCM_CTRLB_IERRCNT(value)           (DRMTCM_CTRLB_IERRCNT_Msk & (_UINT32_(value) << DRMTCM_CTRLB_IERRCNT_Pos)) /* Assigment of value for IERRCNT in the DRMTCM_CTRLB register */
#define DRMTCM_CTRLB_D0ERRCNT_Pos             _UINT32_(8)                                          /* (DRMTCM_CTRLB) D0TCM ERROR MAXIMUM COUNT (default 0x7) Position */
#define DRMTCM_CTRLB_D0ERRCNT_Msk             (_UINT32_(0xFF) << DRMTCM_CTRLB_D0ERRCNT_Pos)        /* (DRMTCM_CTRLB) D0TCM ERROR MAXIMUM COUNT (default 0x7) Mask */
#define DRMTCM_CTRLB_D0ERRCNT(value)          (DRMTCM_CTRLB_D0ERRCNT_Msk & (_UINT32_(value) << DRMTCM_CTRLB_D0ERRCNT_Pos)) /* Assigment of value for D0ERRCNT in the DRMTCM_CTRLB register */
#define DRMTCM_CTRLB_D1ERRCNT_Pos             _UINT32_(16)                                         /* (DRMTCM_CTRLB) D1TCM ERROR MAXIMUM COUNT (default 0x7) Position */
#define DRMTCM_CTRLB_D1ERRCNT_Msk             (_UINT32_(0xFF) << DRMTCM_CTRLB_D1ERRCNT_Pos)        /* (DRMTCM_CTRLB) D1TCM ERROR MAXIMUM COUNT (default 0x7) Mask */
#define DRMTCM_CTRLB_D1ERRCNT(value)          (DRMTCM_CTRLB_D1ERRCNT_Msk & (_UINT32_(value) << DRMTCM_CTRLB_D1ERRCNT_Pos)) /* Assigment of value for D1ERRCNT in the DRMTCM_CTRLB register */
#define DRMTCM_CTRLB_IWAITSTEN_Pos            _UINT32_(24)                                         /* (DRMTCM_CTRLB) ITCM ONE WAIT STATE ENABLE BIT Position */
#define DRMTCM_CTRLB_IWAITSTEN_Msk            (_UINT32_(0x1) << DRMTCM_CTRLB_IWAITSTEN_Pos)        /* (DRMTCM_CTRLB) ITCM ONE WAIT STATE ENABLE BIT Mask */
#define DRMTCM_CTRLB_IWAITSTEN(value)         (DRMTCM_CTRLB_IWAITSTEN_Msk & (_UINT32_(value) << DRMTCM_CTRLB_IWAITSTEN_Pos)) /* Assigment of value for IWAITSTEN in the DRMTCM_CTRLB register */
#define DRMTCM_CTRLB_DWAITSTEN_Pos            _UINT32_(25)                                         /* (DRMTCM_CTRLB) D1TCM and D0TCM ONE WAIT STATE ENABLE BIT Position */
#define DRMTCM_CTRLB_DWAITSTEN_Msk            (_UINT32_(0x1) << DRMTCM_CTRLB_DWAITSTEN_Pos)        /* (DRMTCM_CTRLB) D1TCM and D0TCM ONE WAIT STATE ENABLE BIT Mask */
#define DRMTCM_CTRLB_DWAITSTEN(value)         (DRMTCM_CTRLB_DWAITSTEN_Msk & (_UINT32_(value) << DRMTCM_CTRLB_DWAITSTEN_Pos)) /* Assigment of value for DWAITSTEN in the DRMTCM_CTRLB register */
#define DRMTCM_CTRLB_IERCNTDIS_Pos            _UINT32_(28)                                         /* (DRMTCM_CTRLB) ITCM ERROR COUNTER DISABLE BIT Position */
#define DRMTCM_CTRLB_IERCNTDIS_Msk            (_UINT32_(0x1) << DRMTCM_CTRLB_IERCNTDIS_Pos)        /* (DRMTCM_CTRLB) ITCM ERROR COUNTER DISABLE BIT Mask */
#define DRMTCM_CTRLB_IERCNTDIS(value)         (DRMTCM_CTRLB_IERCNTDIS_Msk & (_UINT32_(value) << DRMTCM_CTRLB_IERCNTDIS_Pos)) /* Assigment of value for IERCNTDIS in the DRMTCM_CTRLB register */
#define DRMTCM_CTRLB_D0ERCNTDIS_Pos           _UINT32_(29)                                         /* (DRMTCM_CTRLB) D0TCM ERROR COUNTER DISABLE BIT Position */
#define DRMTCM_CTRLB_D0ERCNTDIS_Msk           (_UINT32_(0x1) << DRMTCM_CTRLB_D0ERCNTDIS_Pos)       /* (DRMTCM_CTRLB) D0TCM ERROR COUNTER DISABLE BIT Mask */
#define DRMTCM_CTRLB_D0ERCNTDIS(value)        (DRMTCM_CTRLB_D0ERCNTDIS_Msk & (_UINT32_(value) << DRMTCM_CTRLB_D0ERCNTDIS_Pos)) /* Assigment of value for D0ERCNTDIS in the DRMTCM_CTRLB register */
#define DRMTCM_CTRLB_D1ERCNTDIS_Pos           _UINT32_(30)                                         /* (DRMTCM_CTRLB) D1TCM ERROR COUNTER DISABLE BIT Position */
#define DRMTCM_CTRLB_D1ERCNTDIS_Msk           (_UINT32_(0x1) << DRMTCM_CTRLB_D1ERCNTDIS_Pos)       /* (DRMTCM_CTRLB) D1TCM ERROR COUNTER DISABLE BIT Mask */
#define DRMTCM_CTRLB_D1ERCNTDIS(value)        (DRMTCM_CTRLB_D1ERCNTDIS_Msk & (_UINT32_(value) << DRMTCM_CTRLB_D1ERCNTDIS_Pos)) /* Assigment of value for D1ERCNTDIS in the DRMTCM_CTRLB register */
#define DRMTCM_CTRLB_Msk                      _UINT32_(0x73FFFFFF)                                 /* (DRMTCM_CTRLB) Register Mask  */


/* -------- DRMTCM_SYNCBUSY : (DRMTCM Offset: 0x08) ( R/ 32) SYNC BUSY REGISTER -------- */
#define DRMTCM_SYNCBUSY_RESETVALUE            _UINT32_(0x00)                                       /*  (DRMTCM_SYNCBUSY) SYNC BUSY REGISTER  Reset Value */

#define DRMTCM_SYNCBUSY_SWRST_Pos             _UINT32_(0)                                          /* (DRMTCM_SYNCBUSY) Software reset busy bit   --- Synchronizing Busy bit for SWRST Position */
#define DRMTCM_SYNCBUSY_SWRST_Msk             (_UINT32_(0x1) << DRMTCM_SYNCBUSY_SWRST_Pos)         /* (DRMTCM_SYNCBUSY) Software reset busy bit   --- Synchronizing Busy bit for SWRST Mask */
#define DRMTCM_SYNCBUSY_SWRST(value)          (DRMTCM_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << DRMTCM_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the DRMTCM_SYNCBUSY register */
#define DRMTCM_SYNCBUSY_FLTEN_Pos             _UINT32_(1)                                          /* (DRMTCM_SYNCBUSY) Fault Injection Enabled busy bit   --- Synchronizing Busy bit for FLTEN register (when hard-ware set this bit, no writes are allowed to the FLTCTRL register until after the synchronizing is not busy). Position */
#define DRMTCM_SYNCBUSY_FLTEN_Msk             (_UINT32_(0x1) << DRMTCM_SYNCBUSY_FLTEN_Pos)         /* (DRMTCM_SYNCBUSY) Fault Injection Enabled busy bit   --- Synchronizing Busy bit for FLTEN register (when hard-ware set this bit, no writes are allowed to the FLTCTRL register until after the synchronizing is not busy). Mask */
#define DRMTCM_SYNCBUSY_FLTEN(value)          (DRMTCM_SYNCBUSY_FLTEN_Msk & (_UINT32_(value) << DRMTCM_SYNCBUSY_FLTEN_Pos)) /* Assigment of value for FLTEN in the DRMTCM_SYNCBUSY register */
#define DRMTCM_SYNCBUSY_Msk                   _UINT32_(0x00000003)                                 /* (DRMTCM_SYNCBUSY) Register Mask  */


/* -------- DRMTCM_INTENCLR : (DRMTCM Offset: 0x0C) (R/W 32) INTERRUPT ENABLE CLR REGISTER -------- */
#define DRMTCM_INTENCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (DRMTCM_INTENCLR) INTERRUPT ENABLE CLR REGISTER  Reset Value */

#define DRMTCM_INTENCLR_ISERREN_Pos           _UINT32_(0)                                          /* (DRMTCM_INTENCLR) ITCM Single Bit Error Detection Flag bit Disable Position */
#define DRMTCM_INTENCLR_ISERREN_Msk           (_UINT32_(0x1) << DRMTCM_INTENCLR_ISERREN_Pos)       /* (DRMTCM_INTENCLR) ITCM Single Bit Error Detection Flag bit Disable Mask */
#define DRMTCM_INTENCLR_ISERREN(value)        (DRMTCM_INTENCLR_ISERREN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_ISERREN_Pos)) /* Assigment of value for ISERREN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_IDERREN_Pos           _UINT32_(1)                                          /* (DRMTCM_INTENCLR) ITCM Double Bit Error Detection Flag bit Disable Position */
#define DRMTCM_INTENCLR_IDERREN_Msk           (_UINT32_(0x1) << DRMTCM_INTENCLR_IDERREN_Pos)       /* (DRMTCM_INTENCLR) ITCM Double Bit Error Detection Flag bit Disable Mask */
#define DRMTCM_INTENCLR_IDERREN(value)        (DRMTCM_INTENCLR_IDERREN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_IDERREN_Pos)) /* Assigment of value for IDERREN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_IECCECNTEN_Pos        _UINT32_(2)                                          /* (DRMTCM_INTENCLR) ITCM ECC Error Count Flag bit Disable Position */
#define DRMTCM_INTENCLR_IECCECNTEN_Msk        (_UINT32_(0x1) << DRMTCM_INTENCLR_IECCECNTEN_Pos)    /* (DRMTCM_INTENCLR) ITCM ECC Error Count Flag bit Disable Mask */
#define DRMTCM_INTENCLR_IECCECNTEN(value)     (DRMTCM_INTENCLR_IECCECNTEN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_IECCECNTEN_Pos)) /* Assigment of value for IECCECNTEN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_D0SERREN_Pos          _UINT32_(8)                                          /* (DRMTCM_INTENCLR) D0TCM Single Bit Error Detection Flag bit Disable Position */
#define DRMTCM_INTENCLR_D0SERREN_Msk          (_UINT32_(0x1) << DRMTCM_INTENCLR_D0SERREN_Pos)      /* (DRMTCM_INTENCLR) D0TCM Single Bit Error Detection Flag bit Disable Mask */
#define DRMTCM_INTENCLR_D0SERREN(value)       (DRMTCM_INTENCLR_D0SERREN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_D0SERREN_Pos)) /* Assigment of value for D0SERREN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_D0DERREN_Pos          _UINT32_(9)                                          /* (DRMTCM_INTENCLR) D0TCM Double Bit Error Detection Flag bit Disable Position */
#define DRMTCM_INTENCLR_D0DERREN_Msk          (_UINT32_(0x1) << DRMTCM_INTENCLR_D0DERREN_Pos)      /* (DRMTCM_INTENCLR) D0TCM Double Bit Error Detection Flag bit Disable Mask */
#define DRMTCM_INTENCLR_D0DERREN(value)       (DRMTCM_INTENCLR_D0DERREN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_D0DERREN_Pos)) /* Assigment of value for D0DERREN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_D0ECCECNTEN_Pos       _UINT32_(10)                                         /* (DRMTCM_INTENCLR) D0TCM ECC Error Count Flag bit Disable Position */
#define DRMTCM_INTENCLR_D0ECCECNTEN_Msk       (_UINT32_(0x1) << DRMTCM_INTENCLR_D0ECCECNTEN_Pos)   /* (DRMTCM_INTENCLR) D0TCM ECC Error Count Flag bit Disable Mask */
#define DRMTCM_INTENCLR_D0ECCECNTEN(value)    (DRMTCM_INTENCLR_D0ECCECNTEN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_D0ECCECNTEN_Pos)) /* Assigment of value for D0ECCECNTEN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_D1SERREN_Pos          _UINT32_(16)                                         /* (DRMTCM_INTENCLR) D1TCM Single Bit Error Detection Flag bit Disable Position */
#define DRMTCM_INTENCLR_D1SERREN_Msk          (_UINT32_(0x1) << DRMTCM_INTENCLR_D1SERREN_Pos)      /* (DRMTCM_INTENCLR) D1TCM Single Bit Error Detection Flag bit Disable Mask */
#define DRMTCM_INTENCLR_D1SERREN(value)       (DRMTCM_INTENCLR_D1SERREN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_D1SERREN_Pos)) /* Assigment of value for D1SERREN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_D1DERREN_Pos          _UINT32_(17)                                         /* (DRMTCM_INTENCLR) D1TCM Double Bit Error Detection Flag bit Disable Position */
#define DRMTCM_INTENCLR_D1DERREN_Msk          (_UINT32_(0x1) << DRMTCM_INTENCLR_D1DERREN_Pos)      /* (DRMTCM_INTENCLR) D1TCM Double Bit Error Detection Flag bit Disable Mask */
#define DRMTCM_INTENCLR_D1DERREN(value)       (DRMTCM_INTENCLR_D1DERREN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_D1DERREN_Pos)) /* Assigment of value for D1DERREN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_D1ECCECNTEN_Pos       _UINT32_(18)                                         /* (DRMTCM_INTENCLR) D1TCM ECC Error Count Flag bit Disable Position */
#define DRMTCM_INTENCLR_D1ECCECNTEN_Msk       (_UINT32_(0x1) << DRMTCM_INTENCLR_D1ECCECNTEN_Pos)   /* (DRMTCM_INTENCLR) D1TCM ECC Error Count Flag bit Disable Mask */
#define DRMTCM_INTENCLR_D1ECCECNTEN(value)    (DRMTCM_INTENCLR_D1ECCECNTEN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_D1ECCECNTEN_Pos)) /* Assigment of value for D1ECCECNTEN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_FLTCAPEN_Pos          _UINT32_(24)                                         /* (DRMTCM_INTENCLR) Fault Capture interrupt enable bit Disable Position */
#define DRMTCM_INTENCLR_FLTCAPEN_Msk          (_UINT32_(0x1) << DRMTCM_INTENCLR_FLTCAPEN_Pos)      /* (DRMTCM_INTENCLR) Fault Capture interrupt enable bit Disable Mask */
#define DRMTCM_INTENCLR_FLTCAPEN(value)       (DRMTCM_INTENCLR_FLTCAPEN_Msk & (_UINT32_(value) << DRMTCM_INTENCLR_FLTCAPEN_Pos)) /* Assigment of value for FLTCAPEN in the DRMTCM_INTENCLR register */
#define DRMTCM_INTENCLR_Msk                   _UINT32_(0x01070707)                                 /* (DRMTCM_INTENCLR) Register Mask  */


/* -------- DRMTCM_INTENSET : (DRMTCM Offset: 0x10) (R/W 32) INTERRUPT ENABLE SET REGISTER -------- */
#define DRMTCM_INTENSET_RESETVALUE            _UINT32_(0x00)                                       /*  (DRMTCM_INTENSET) INTERRUPT ENABLE SET REGISTER  Reset Value */

#define DRMTCM_INTENSET_ISERREN_Pos           _UINT32_(0)                                          /* (DRMTCM_INTENSET) ITCM Single Bit Error Detection Flag bit Enable Position */
#define DRMTCM_INTENSET_ISERREN_Msk           (_UINT32_(0x1) << DRMTCM_INTENSET_ISERREN_Pos)       /* (DRMTCM_INTENSET) ITCM Single Bit Error Detection Flag bit Enable Mask */
#define DRMTCM_INTENSET_ISERREN(value)        (DRMTCM_INTENSET_ISERREN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_ISERREN_Pos)) /* Assigment of value for ISERREN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_IDERREN_Pos           _UINT32_(1)                                          /* (DRMTCM_INTENSET) ITCM Double Bit Error Detection Flag bit Enable Position */
#define DRMTCM_INTENSET_IDERREN_Msk           (_UINT32_(0x1) << DRMTCM_INTENSET_IDERREN_Pos)       /* (DRMTCM_INTENSET) ITCM Double Bit Error Detection Flag bit Enable Mask */
#define DRMTCM_INTENSET_IDERREN(value)        (DRMTCM_INTENSET_IDERREN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_IDERREN_Pos)) /* Assigment of value for IDERREN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_IECCECNTEN_Pos        _UINT32_(2)                                          /* (DRMTCM_INTENSET) ITCM ECC Error Count Flag bit Enable Position */
#define DRMTCM_INTENSET_IECCECNTEN_Msk        (_UINT32_(0x1) << DRMTCM_INTENSET_IECCECNTEN_Pos)    /* (DRMTCM_INTENSET) ITCM ECC Error Count Flag bit Enable Mask */
#define DRMTCM_INTENSET_IECCECNTEN(value)     (DRMTCM_INTENSET_IECCECNTEN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_IECCECNTEN_Pos)) /* Assigment of value for IECCECNTEN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_D0SERREN_Pos          _UINT32_(8)                                          /* (DRMTCM_INTENSET) D0TCM Single Bit Error Detection Flag bit Enable Position */
#define DRMTCM_INTENSET_D0SERREN_Msk          (_UINT32_(0x1) << DRMTCM_INTENSET_D0SERREN_Pos)      /* (DRMTCM_INTENSET) D0TCM Single Bit Error Detection Flag bit Enable Mask */
#define DRMTCM_INTENSET_D0SERREN(value)       (DRMTCM_INTENSET_D0SERREN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_D0SERREN_Pos)) /* Assigment of value for D0SERREN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_D0DERREN_Pos          _UINT32_(9)                                          /* (DRMTCM_INTENSET) D0TCM Double Bit Error Detection Flag bit Enable Position */
#define DRMTCM_INTENSET_D0DERREN_Msk          (_UINT32_(0x1) << DRMTCM_INTENSET_D0DERREN_Pos)      /* (DRMTCM_INTENSET) D0TCM Double Bit Error Detection Flag bit Enable Mask */
#define DRMTCM_INTENSET_D0DERREN(value)       (DRMTCM_INTENSET_D0DERREN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_D0DERREN_Pos)) /* Assigment of value for D0DERREN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_D0ECCECNTEN_Pos       _UINT32_(10)                                         /* (DRMTCM_INTENSET) D0TCM ECC Error Count Flag bit Enable Position */
#define DRMTCM_INTENSET_D0ECCECNTEN_Msk       (_UINT32_(0x1) << DRMTCM_INTENSET_D0ECCECNTEN_Pos)   /* (DRMTCM_INTENSET) D0TCM ECC Error Count Flag bit Enable Mask */
#define DRMTCM_INTENSET_D0ECCECNTEN(value)    (DRMTCM_INTENSET_D0ECCECNTEN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_D0ECCECNTEN_Pos)) /* Assigment of value for D0ECCECNTEN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_D1SERREN_Pos          _UINT32_(16)                                         /* (DRMTCM_INTENSET) D1TCM Single Bit Error Detection Flag bit Enable Position */
#define DRMTCM_INTENSET_D1SERREN_Msk          (_UINT32_(0x1) << DRMTCM_INTENSET_D1SERREN_Pos)      /* (DRMTCM_INTENSET) D1TCM Single Bit Error Detection Flag bit Enable Mask */
#define DRMTCM_INTENSET_D1SERREN(value)       (DRMTCM_INTENSET_D1SERREN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_D1SERREN_Pos)) /* Assigment of value for D1SERREN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_D1DERREN_Pos          _UINT32_(17)                                         /* (DRMTCM_INTENSET) D1TCM Double Bit Error Detection Flag bit Enable Position */
#define DRMTCM_INTENSET_D1DERREN_Msk          (_UINT32_(0x1) << DRMTCM_INTENSET_D1DERREN_Pos)      /* (DRMTCM_INTENSET) D1TCM Double Bit Error Detection Flag bit Enable Mask */
#define DRMTCM_INTENSET_D1DERREN(value)       (DRMTCM_INTENSET_D1DERREN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_D1DERREN_Pos)) /* Assigment of value for D1DERREN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_D1ECCECNTEN_Pos       _UINT32_(18)                                         /* (DRMTCM_INTENSET) D1TCM ECC Error Count Flag bit Enable Position */
#define DRMTCM_INTENSET_D1ECCECNTEN_Msk       (_UINT32_(0x1) << DRMTCM_INTENSET_D1ECCECNTEN_Pos)   /* (DRMTCM_INTENSET) D1TCM ECC Error Count Flag bit Enable Mask */
#define DRMTCM_INTENSET_D1ECCECNTEN(value)    (DRMTCM_INTENSET_D1ECCECNTEN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_D1ECCECNTEN_Pos)) /* Assigment of value for D1ECCECNTEN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_FLTCAPEN_Pos          _UINT32_(24)                                         /* (DRMTCM_INTENSET) Fault Capture interrupt enable bit Enable Position */
#define DRMTCM_INTENSET_FLTCAPEN_Msk          (_UINT32_(0x1) << DRMTCM_INTENSET_FLTCAPEN_Pos)      /* (DRMTCM_INTENSET) Fault Capture interrupt enable bit Enable Mask */
#define DRMTCM_INTENSET_FLTCAPEN(value)       (DRMTCM_INTENSET_FLTCAPEN_Msk & (_UINT32_(value) << DRMTCM_INTENSET_FLTCAPEN_Pos)) /* Assigment of value for FLTCAPEN in the DRMTCM_INTENSET register */
#define DRMTCM_INTENSET_Msk                   _UINT32_(0x01070707)                                 /* (DRMTCM_INTENSET) Register Mask  */


/* -------- DRMTCM_INTFLAG : (DRMTCM Offset: 0x14) (R/W 32) INTERRUPT FLAG REGISTER -------- */
#define DRMTCM_INTFLAG_RESETVALUE             _UINT32_(0x00)                                       /*  (DRMTCM_INTFLAG) INTERRUPT FLAG REGISTER  Reset Value */

