Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/drmtcm.h
#define DRMTCM_D1FLTPAR_SECIN_Pos             _UINT32_(0)                                          /* (DRMTCM_D1FLTPAR) Single Error Parity Bits from D1TCM Position */
#define DRMTCM_D1FLTPAR_SECIN_Msk             (_UINT32_(0x7F) << DRMTCM_D1FLTPAR_SECIN_Pos)        /* (DRMTCM_D1FLTPAR) Single Error Parity Bits from D1TCM Mask */
#define DRMTCM_D1FLTPAR_SECIN(value)          (DRMTCM_D1FLTPAR_SECIN_Msk & (_UINT32_(value) << DRMTCM_D1FLTPAR_SECIN_Pos)) /* Assigment of value for SECIN in the DRMTCM_D1FLTPAR register */
#define DRMTCM_D1FLTPAR_Msk                   _UINT32_(0x0000007F)                                 /* (DRMTCM_D1FLTPAR) Register Mask  */


/* -------- DRMTCM_D1FLTSYN : (DRMTCM Offset: 0x4C) ( R/ 32) D1TCM FAULT ECC SYNDROME REGISTER -------- */
#define DRMTCM_D1FLTSYN_RESETVALUE            _UINT32_(0x00)                                       /*  (DRMTCM_D1FLTSYN) D1TCM FAULT ECC SYNDROME REGISTER  Reset Value */

#define DRMTCM_D1FLTSYN_SECSYN_Pos            _UINT32_(0)                                          /* (DRMTCM_D1FLTSYN) Single Error Syndrome Position */
#define DRMTCM_D1FLTSYN_SECSYN_Msk            (_UINT32_(0x7F) << DRMTCM_D1FLTSYN_SECSYN_Pos)       /* (DRMTCM_D1FLTSYN) Single Error Syndrome Mask */
#define DRMTCM_D1FLTSYN_SECSYN(value)         (DRMTCM_D1FLTSYN_SECSYN_Msk & (_UINT32_(value) << DRMTCM_D1FLTSYN_SECSYN_Pos)) /* Assigment of value for SECSYN in the DRMTCM_D1FLTSYN register */
#define DRMTCM_D1FLTSYN_ERR1_Pos              _UINT32_(14)                                         /* (DRMTCM_D1FLTSYN) Single Bit Error Position */
#define DRMTCM_D1FLTSYN_ERR1_Msk              (_UINT32_(0x1) << DRMTCM_D1FLTSYN_ERR1_Pos)          /* (DRMTCM_D1FLTSYN) Single Bit Error Mask */
#define DRMTCM_D1FLTSYN_ERR1(value)           (DRMTCM_D1FLTSYN_ERR1_Msk & (_UINT32_(value) << DRMTCM_D1FLTSYN_ERR1_Pos)) /* Assigment of value for ERR1 in the DRMTCM_D1FLTSYN register */
#define DRMTCM_D1FLTSYN_ERR2_Pos              _UINT32_(15)                                         /* (DRMTCM_D1FLTSYN) Double bit Error Position */
#define DRMTCM_D1FLTSYN_ERR2_Msk              (_UINT32_(0x1) << DRMTCM_D1FLTSYN_ERR2_Pos)          /* (DRMTCM_D1FLTSYN) Double bit Error Mask */
#define DRMTCM_D1FLTSYN_ERR2(value)           (DRMTCM_D1FLTSYN_ERR2_Msk & (_UINT32_(value) << DRMTCM_D1FLTSYN_ERR2_Pos)) /* Assigment of value for ERR2 in the DRMTCM_D1FLTSYN register */
#define DRMTCM_D1FLTSYN_Msk                   _UINT32_(0x0000C07F)                                 /* (DRMTCM_D1FLTSYN) Register Mask  */

#define DRMTCM_D1FLTSYN_ERR_Pos               _UINT32_(14)                                         /* (DRMTCM_D1FLTSYN Position) Double bit Error */
#define DRMTCM_D1FLTSYN_ERR_Msk               (_UINT32_(0x3) << DRMTCM_D1FLTSYN_ERR_Pos)           /* (DRMTCM_D1FLTSYN Mask) ERR */
#define DRMTCM_D1FLTSYN_ERR(value)            (DRMTCM_D1FLTSYN_ERR_Msk & (_UINT32_(value) << DRMTCM_D1FLTSYN_ERR_Pos)) 

/** \brief DRMTCM register offsets definitions */
#define DRMTCM_CTRLA_REG_OFST          _UINT32_(0x00)      /* (DRMTCM_CTRLA) CONTROL ENABLE REGISTER A Offset */
#define DRMTCM_CTRLB_REG_OFST          _UINT32_(0x04)      /* (DRMTCM_CTRLB) CONTROL ENABLE REGISTER B Offset */
#define DRMTCM_SYNCBUSY_REG_OFST       _UINT32_(0x08)      /* (DRMTCM_SYNCBUSY) SYNC BUSY REGISTER Offset */
#define DRMTCM_INTENCLR_REG_OFST       _UINT32_(0x0C)      /* (DRMTCM_INTENCLR) INTERRUPT ENABLE CLR REGISTER Offset */
#define DRMTCM_INTENSET_REG_OFST       _UINT32_(0x10)      /* (DRMTCM_INTENSET) INTERRUPT ENABLE SET REGISTER Offset */
#define DRMTCM_INTFLAG_REG_OFST        _UINT32_(0x14)      /* (DRMTCM_INTFLAG) INTERRUPT FLAG REGISTER Offset */
#define DRMTCM_FLTCTRL_REG_OFST        _UINT32_(0x18)      /* (DRMTCM_FLTCTRL) FAULT INJECTION CONTROL REGISTER Offset */
#define DRMTCM_IFLTPTR_REG_OFST        _UINT32_(0x1C)      /* (DRMTCM_IFLTPTR) ITCM FAULT INJECTION POINTER REGISTER Offset */
#define DRMTCM_IFLTADR_REG_OFST        _UINT32_(0x20)      /* (DRMTCM_IFLTADR) ITCM FAULT INJECTION ADDRESS REGISTER Offset */
#define DRMTCM_IFLTCAP_REG_OFST        _UINT32_(0x24)      /* (DRMTCM_IFLTCAP) ITCM FAULT ERROR CAPTURE ADDRESS REGISTER Offset */
#define DRMTCM_IFLTPAR_REG_OFST        _UINT32_(0x28)      /* (DRMTCM_IFLTPAR) ITCM FAULT PARITY REGISTER Offset */
#define DRMTCM_IFLTSYN_REG_OFST        _UINT32_(0x2C)      /* (DRMTCM_IFLTSYN) ITCM FAULT ECC SYNDROME REGISTER Offset */
#define DRMTCM_DFLTPTR_REG_OFST        _UINT32_(0x30)      /* (DRMTCM_DFLTPTR) DTCM FAULT INJECTION POINTER REGISTER Offset */
#define DRMTCM_DFLTADR_REG_OFST        _UINT32_(0x34)      /* (DRMTCM_DFLTADR) DTCM FAULT INJECTION ADDRESS REGISTER Offset */
#define DRMTCM_D0FLTCAP_REG_OFST       _UINT32_(0x38)      /* (DRMTCM_D0FLTCAP) D0TCM FAULT ERROR CAPTURE ADDRESS REGISTER Offset */
#define DRMTCM_D0FLTPAR_REG_OFST       _UINT32_(0x3C)      /* (DRMTCM_D0FLTPAR) D0TCM FAULT PARITY REGISTER Offset */
#define DRMTCM_D0FLTSYN_REG_OFST       _UINT32_(0x40)      /* (DRMTCM_D0FLTSYN) D0TCM FAULT ECC SYNDROME REGISTER Offset */
#define DRMTCM_D1FLTCAP_REG_OFST       _UINT32_(0x44)      /* (DRMTCM_D1FLTCAP) D1TCM FAULT ERROR CAPTURE ADDRESS REGISTER Offset */
#define DRMTCM_D1FLTPAR_REG_OFST       _UINT32_(0x48)      /* (DRMTCM_D1FLTPAR) D1TCM FAULT PARITY REGISTER Offset */
#define DRMTCM_D1FLTSYN_REG_OFST       _UINT32_(0x4C)      /* (DRMTCM_D1FLTSYN) D1TCM FAULT ECC SYNDROME REGISTER Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DRMTCM register API structure */
typedef struct
{  /* DRM TCM ECC */
  __IO  uint32_t                       DRMTCM_CTRLA;       /**< Offset: 0x00 (R/W  32) CONTROL ENABLE REGISTER A */
  __IO  uint32_t                       DRMTCM_CTRLB;       /**< Offset: 0x04 (R/W  32) CONTROL ENABLE REGISTER B */
  __I   uint32_t                       DRMTCM_SYNCBUSY;    /**< Offset: 0x08 (R/   32) SYNC BUSY REGISTER */
  __IO  uint32_t                       DRMTCM_INTENCLR;    /**< Offset: 0x0C (R/W  32) INTERRUPT ENABLE CLR REGISTER */
  __IO  uint32_t                       DRMTCM_INTENSET;    /**< Offset: 0x10 (R/W  32) INTERRUPT ENABLE SET REGISTER */
  __IO  uint32_t                       DRMTCM_INTFLAG;     /**< Offset: 0x14 (R/W  32) INTERRUPT FLAG REGISTER */
  __IO  uint32_t                       DRMTCM_FLTCTRL;     /**< Offset: 0x18 (R/W  32) FAULT INJECTION CONTROL REGISTER */
  __IO  uint32_t                       DRMTCM_IFLTPTR;     /**< Offset: 0x1C (R/W  32) ITCM FAULT INJECTION POINTER REGISTER */
  __IO  uint32_t                       DRMTCM_IFLTADR;     /**< Offset: 0x20 (R/W  32) ITCM FAULT INJECTION ADDRESS REGISTER */
  __I   uint32_t                       DRMTCM_IFLTCAP;     /**< Offset: 0x24 (R/   32) ITCM FAULT ERROR CAPTURE ADDRESS REGISTER */
  __I   uint32_t                       DRMTCM_IFLTPAR;     /**< Offset: 0x28 (R/   32) ITCM FAULT PARITY REGISTER */
  __I   uint32_t                       DRMTCM_IFLTSYN;     /**< Offset: 0x2C (R/   32) ITCM FAULT ECC SYNDROME REGISTER */
  __IO  uint32_t                       DRMTCM_DFLTPTR;     /**< Offset: 0x30 (R/W  32) DTCM FAULT INJECTION POINTER REGISTER */
  __IO  uint32_t                       DRMTCM_DFLTADR;     /**< Offset: 0x34 (R/W  32) DTCM FAULT INJECTION ADDRESS REGISTER */
  __I   uint32_t                       DRMTCM_D0FLTCAP;    /**< Offset: 0x38 (R/   32) D0TCM FAULT ERROR CAPTURE ADDRESS REGISTER */
  __I   uint32_t                       DRMTCM_D0FLTPAR;    /**< Offset: 0x3C (R/   32) D0TCM FAULT PARITY REGISTER */
  __I   uint32_t                       DRMTCM_D0FLTSYN;    /**< Offset: 0x40 (R/   32) D0TCM FAULT ECC SYNDROME REGISTER */
  __I   uint32_t                       DRMTCM_D1FLTCAP;    /**< Offset: 0x44 (R/   32) D1TCM FAULT ERROR CAPTURE ADDRESS REGISTER */
  __I   uint32_t                       DRMTCM_D1FLTPAR;    /**< Offset: 0x48 (R/   32) D1TCM FAULT PARITY REGISTER */
  __I   uint32_t                       DRMTCM_D1FLTSYN;    /**< Offset: 0x4C (R/   32) D1TCM FAULT ECC SYNDROME REGISTER */
} drmtcm_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZCA90_DRMTCM_COMPONENT_H_ */
